# Carga y Preprocesamiento de Datos:

In [14]:
import pandas as pd  # importamos pandas para la carga y preprocesamiento de datos
df = pd.read_csv(r'retail_sales_dataset.csv') # consumimos el csv que ya esta cargado dentro del repo
df # imprimimos para visualizar los datos en gral

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100
...,...,...,...,...,...,...,...,...,...
995,996,2023-05-16,CUST996,Male,62,Clothing,1,50,50
996,997,2023-11-17,CUST997,Male,52,Beauty,3,30,90
997,998,2023-10-29,CUST998,Female,23,Beauty,4,25,100
998,999,2023-12-05,CUST999,Female,36,Electronics,3,50,150
999,1000,2023-04-12,CUST1000,Male,47,Electronics,4,30,120

In [15]:
df.describe(include="all") ##Datos generales del dataframe

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
count,1000.000000,1000,1000,1000,1000.00000,1000,1000.000000,1000.000000,1000.000000
unique,NaN,345,1000,2,NaN,3,NaN,NaN,NaN
top,NaN,2023-05-16,CUST001,Female,NaN,Clothing,NaN,NaN,NaN
freq,NaN,11,1,510,NaN,351,NaN,NaN,NaN
mean,500.500000,NaN,NaN,NaN,41.39200,NaN,2.514000,179.890000,456.000000
std,288.819436,NaN,NaN,NaN,13.68143,NaN,1.132734,189.681356,559.997632
min,1.000000,NaN,NaN,NaN,18.00000,NaN,1.000000,25.000000,25.000000
25%,250.750000,NaN,NaN,NaN,29.00000,NaN,1.000000,30.000000,60.000000
50%,500.500000,NaN,NaN,NaN,42.00000,NaN,3.000000,50.000000,135.000000
75%,750.250000,NaN,NaN,NaN,53.00000,NaN,4.000000,300.000000,900.000000
max,1000.000000,NaN,NaN,NaN,64.00000,NaN,4.000000,500.000000,2000.000000

In [23]:
df.isnull().sum() # Verificación de datos nulls
#no nulls

Transaction ID      0
Date                0
Customer ID         0
Gender              0
Age                 0
Product Category    0
Quantity            0
Price per Unit      0
Total Amount        0
dtype: int64

In [24]:
df.duplicated().sum() # verificaicón de duplicados 
# no se registran duplicados

0

In [26]:
df.dtypes

Transaction ID       int64
Date                object
Customer ID         object
Gender              object
Age                  int64
Product Category    object
Quantity             int64
Price per Unit       int64
Total Amount         int64
dtype: object

In [27]:
df['Date']= pd.to_datetime(df['Date']) # pasamos a datetime el campo correspondiente a la fecha
df['Total Amount'] = pd.to_numeric(df['Total Amount'].astype('float64'))
df.dtypes

Transaction ID               int64
Date                datetime64[ns]
Customer ID                 object
Gender                      object
Age                          int64
Product Category            object
Quantity                     int64
Price per Unit               int64
Total Amount               float64
dtype: object

# Exploración de Datos

In [39]:
total_by_category = df.groupby('Product Category')['Total Amount'].sum() # Calculamos la suma de productos por categoría

average_by_category = df.groupby(['Date' , 'Product Category'])['Total Amount'].sum().mean() # Calculamos el promedio de productos por categoría

# Categoría con mayor venta total
max_sale_category = total_by_category.idxmax() 
max_sale_value = total_by_category.max()

# Categoría con menor venta total
min_sale_category = total_by_category.idxmin()
min_sale_value = total_by_category.min()


print(f"Ventas totales por categoria: {total_by_category}\n")
print(f"Promedio de ventas por categoria: {average_by_category}")
print(f"Categoria con mayor venta: {max_sale_category} {max_sale_value}")
print(f"Categoria con menor venta: {min_sale_category} {min_sale_category}")

Ventas totales por categoria: Product Category
Beauty         143515.0
Clothing       155580.0
Electronics    156905.0
Name: Total Amount, dtype: float64

Promedio de ventas por categoria: 696.1832061068702
Categoria con mayor venta: Electronics 156905.0
Categoria con menor venta: Beauty Beauty

# Manipulación de datos

In [40]:
total_by_category['Beauty'] ## Filtramos las ventas de un producto especifico

143515.0